# Titel

In [24]:
import pandas as pd

#to generate random numbers
from numpy.random import randn

In [25]:
#2dimensional data structures - list
print("Some two-dimensional data types:")
list_2dim = [[10112,"Berlin",3460725],[20095,"Hamburg",1786445],[80331,"München",1353185]]
print("\nThis is a simple 2dim list:")
print (list_2dim)
print(type(list_2dim))

print(list_2dim[1][2])

Some two-dimensional data types:

This is a simple 2dim list:
[[10112, 'Berlin', 3460725], [20095, 'Hamburg', 1786445], [80331, 'München', 1353185]]
<class 'list'>
1786445

In [26]:
#2dimensional data structures - array
array_ran = randn(3,3)
print("\nThis is a simple 2dim array:")
print (array_ran)
print(type(array_ran))

print (array_ran[0,1])

This is a simple 2dim array:
[[-2.47689734  0.50472191 -0.55958777]
 [ 1.43083798  0.27412554 -0.0593555 ]
 [ 1.25018654  0.18187333 -0.35174972]]
<class 'numpy.ndarray'>
0.5047219113213219

In [27]:
#2dimensional data structures - PANDAS data frame
df = pd.DataFrame(array_ran,index=['ID1','ID2','ID3'],columns=['A1','A2','A3'])
print(type(df))
print("\nThis is a PANDAS dataframe:")
df

<class 'pandas.core.frame.DataFrame'>

This is a PANDAS dataframe:

           A1        A2        A3
ID1 -2.476897  0.504722 -0.559588
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750

In [28]:
#select column
df['A1']

ID1   -2.476897
ID2    1.430838
ID3    1.250187
Name: A1, dtype: float64

In [29]:
#select list of columns 
df[['A1','A3']]

           A1        A3
ID1 -2.476897 -0.559588
ID2  1.430838 -0.059356
ID3  1.250187 -0.351750

In [30]:
#create new column
df['A1+A2']=df['A1']+df['A2']
df

           A1        A2        A3     A1+A2
ID1 -2.476897  0.504722 -0.559588 -1.972175
ID2  1.430838  0.274126 -0.059356  1.704964
ID3  1.250187  0.181873 -0.351750  1.432060

In [31]:
#drop column temporarily
df.drop('A1+A2',axis=1)

           A1        A2        A3
ID1 -2.476897  0.504722 -0.559588
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750

In [32]:
df

           A1        A2        A3     A1+A2
ID1 -2.476897  0.504722 -0.559588 -1.972175
ID2  1.430838  0.274126 -0.059356  1.704964
ID3  1.250187  0.181873 -0.351750  1.432060

In [33]:
#drop column permanently
df.drop('A1+A2',axis=1,inplace=True)

In [34]:
df

           A1        A2        A3
ID1 -2.476897  0.504722 -0.559588
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750

In [35]:
#select row
df.loc['ID1']

A1   -2.476897
A2    0.504722
A3   -0.559588
Name: ID1, dtype: float64

In [36]:
#drop row temp
df.drop('ID1',axis=0)

           A1        A2        A3
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750

In [37]:
#select rows and columns at once
df.loc[['ID2','ID3'],['A1','A2']]

           A1        A2
ID2  1.430838  0.274126
ID3  1.250187  0.181873

In [38]:
df

           A1        A2        A3
ID1 -2.476897  0.504722 -0.559588
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750

In [39]:
#conditional selection
df >= 0

        A1    A2     A3
ID1  False  True  False
ID2   True  True  False
ID3   True  True  False

In [40]:
#conditional selection
df[df['A3']>=1]
#df[df['A3']<0]['A1']

Empty DataFrame
Columns: [A1, A2, A3]
Index: []

In [41]:
#descriptive statistics
df.describe()

             A1        A2        A3
count  3.000000  3.000000  3.000000
mean   0.068042  0.320240 -0.323564
std    2.205833  0.166291  0.251304
min   -2.476897  0.181873 -0.559588
25%   -0.613355  0.227999 -0.455669
50%    1.250187  0.274126 -0.351750
75%    1.340512  0.389424 -0.205553
max    1.430838  0.504722 -0.059356

In [42]:
#non-missing values and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, ID1 to ID3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      3 non-null      float64
 1   A2      3 non-null      float64
 2   A3      3 non-null      float64
dtypes: float64(3)
memory usage: 204.0+ bytes

In [43]:
df

           A1        A2        A3
ID1 -2.476897  0.504722 -0.559588
ID2  1.430838  0.274126 -0.059356
ID3  1.250187  0.181873 -0.351750